const obj = {
    code: 200,
    data: [{ userId: 1, id: 1, title: '旺仔牛奶', introduce: '旺仔牛奶相信大家都喝过，小时候常常能在电视上看到它的广告，各种广告台词也深入人心，一看到它的IP就总…真正的牛奶，而是一种复原乳，还被称为再制奶，它是用浓缩乳或者乳粉加入一定比例的水重新做成的一款乳液' }, { userId: 1, id: 2, title: '旺旺碎冰冰', introduce: '这款旺旺碎冰冰实在太棒了太好吃了,旺旺是大品牌质量有保障,品质信得过,孩子非常喜欢吃,各种口味都有,酸甜可口,让人爱不释口,回味无穷液' }, { userId: 1, id: 3, title: '喜之郎', introduce: '喜之郎品牌，创立于1992年，属于广东喜之郎集团有限公司，旗下产品包括喜之郎果冻、美好时光海苔、优乐美奶茶、开心时间饼干等。喜之郎系列产品被评为“中国名牌产品”液' }, { userId: 1, id: 4, title: '德芙', introduce: '德芙巧克力似乎早已成为人们传递情感、享受美好瞬间的首选佳品。面对太多的选择,消费者关心的不仅仅是一盒糖果,而是产品的品质如何、口感如何、味道如何,价格是优惠等液' }, { userId: 1, id: 5, title: '卫龙辣条', introduce: '一直以来,卫龙美味坚守“让世界人人爱上中国味”的使命,不懈努力实现“传统美食娱乐化、休闲化、便捷化、亲民化、数智化,乐活123年的生态平台”的美好愿景,以传统美味为载体' }, { userId: 1, id: 6, title: '伊利纯牛奶', introduce: '伊利纯牛奶是伊利旗下很受欢迎的一款奶制品，含有很丰富的蛋白质、钙元素以及其它微量元素，给儿童、青少年、中老年人以及孕妇补充身体所需要的能量，并促进身体健康' }, { userId: 1, id: 7, title: '旺仔牛奶', introduce: '旺仔牛奶相信大家都喝过，小时候常常能在电视上看到它的广告，各种广告台词也深入人心，一看到它的IP就总…真正的牛奶，而是一种复原乳，还被称为再制奶，它是用浓缩乳或者乳粉加入一定比例的水重新做成的一款乳液' }, { userId: 1, id: 8, title: '旺旺碎冰冰', introduce: '这款旺旺碎冰冰实在太棒了太好吃了,旺旺是大品牌质量有保障,品质信得过,孩子非常喜欢吃,各种口味都有,酸甜可口,让人爱不释口,回味无穷液' }, { userId: 1, id: 9, title: '喜之郎', introduce: '喜之郎品牌，创立于1992年，属于广东喜之郎集团有限公司，旗下产品包括喜之郎果冻、美好时光海苔、优乐美奶茶、开心时间饼干等。喜之郎系列产品被评为“中国名牌产品”液' }, { userId: 1, id: 10, title: '德芙', introduce: '德芙巧克力似乎早已成为人们传递情感、享受美好瞬间的首选佳品。面对太多的选择,消费者关心的不仅仅是一盒糖果,而是产品的品质如何、口感如何、味道如何,价格是优惠等液' }
        , { userId: 1, id: 11, title: '伊利纯牛奶', introduce: '伊利纯牛奶是伊利旗下很受欢迎的一款奶制品，含有很丰富的蛋白质、钙元素以及其它微量元素，给儿童、青少年、中老年人以及孕妇补充身体所需要的能量，并促进身体健康' }
        , { userId: 1, id: 12, title: '卫龙辣条', introduce: '一直以来,卫龙美味坚守“让世界人人爱上中国味”的使命,不懈努力实现“传统美食娱乐化、休闲化、便捷化、亲民化、数智化,乐活123年的生态平台”的美好愿景,以传统美味为载体' }
        , { userId: 1, id: 13, title: '旺旺碎冰冰', introduce: '这款旺旺碎冰冰实在太棒了太好吃了,旺旺是大品牌质量有保障,品质信得过,孩子非常喜欢吃,各种口味都有,酸甜可口,让人爱不释口,回味无穷液' }
        , { userId: 1, id: 14, title: '卫龙辣条', introduce: '一直以来,卫龙美味坚守“让世界人人爱上中国味”的使命,不懈努力实现“传统美食娱乐化、休闲化、便捷化、亲民化、数智化,乐活123年的生态平台”的美好愿景,以传统美味为载体' }
        , { userId: 1, id: 15, title: '德芙', introduce: '德芙巧克力似乎早已成为人们传递情感、享受美好瞬间的首选佳品。面对太多的选择,消费者关心的不仅仅是一盒糖果,而是产品的品质如何、口感如何、味道如何,价格是优惠等液' }
        , { userId: 1, id: 16, title: '伊利纯牛奶', introduce: '伊利纯牛奶是伊利旗下很受欢迎的一款奶制品，含有很丰富的蛋白质、钙元素以及其它微量元素，给儿童、青少年、中老年人以及孕妇补充身体所需要的能量，并促进身体健康' }
        , { userId: 1, id: 17, title: '旺仔牛奶', introduce: '旺仔牛奶相信大家都喝过，小时候常常能在电视上看到它的广告，各种广告台词也深入人心，一看到它的IP就总…真正的牛奶，而是一种复原乳，还被称为再制奶，它是用浓缩乳或者乳粉加入一定比例的水重新做成的一款乳液' }
        , { userId: 1, id: 18, title: '卫龙辣条', introduce: '一直以来,卫龙美味坚守“让世界人人爱上中国味”的使命,不懈努力实现“传统美食娱乐化、休闲化、便捷化、亲民化、数智化,乐活123年的生态平台”的美好愿景,以传统美味为载体' }
        , { userId: 1, id: 19, title: '喜之郎', introduce: '喜之郎品牌，创立于1992年，属于广东喜之郎集团有限公司，旗下产品包括喜之郎果冻、美好时光海苔、优乐美奶茶、开心时间饼干等。喜之郎系列产品被评为“中国名牌产品”液' }
        , { userId: 1, id: 20, title: '德芙', introduce: '德芙巧克力似乎早已成为人们传递情感、享受美好瞬间的首选佳品。面对太多的选择,消费者关心的不仅仅是一盒糖果,而是产品的品质如何、口感如何、味道如何,价格是优惠等液' }
        , { userId: 1, id: 21, title: '伊利纯牛奶', introduce: '伊利纯牛奶是伊利旗下很受欢迎的一款奶制品，含有很丰富的蛋白质、钙元素以及其它微量元素，给儿童、青少年、中老年人以及孕妇补充身体所需要的能量，并促进身体健康' }
        , { userId: 1, id: 22, title: '旺仔牛奶', introduce: '旺仔牛奶相信大家都喝过，小时候常常能在电视上看到它的广告，各种广告台词也深入人心，一看到它的IP就总…真正的牛奶，而是一种复原乳，还被称为再制奶，它是用浓缩乳或者乳粉加入一定比例的水重新做成的一款乳液' }
        , { userId: 1, id: 23, title: '旺旺碎冰冰', introduce: '这款旺旺碎冰冰实在太棒了太好吃了,旺旺是大品牌质量有保障,品质信得过,孩子非常喜欢吃,各种口味都有,酸甜可口,让人爱不释口,回味无穷液' }
        , { userId: 1, id: 24, title: '喜之郎', introduce: '喜之郎品牌，创立于1992年，属于广东喜之郎集团有限公司，旗下产品包括喜之郎果冻、美好时光海苔、优乐美奶茶、开心时间饼干等。喜之郎系列产品被评为“中国名牌产品”液' }
        , { userId: 1, id: 25, title: '德芙', introduce: '德芙巧克力似乎早已成为人们传递情感、享受美好瞬间的首选佳品。面对太多的选择,消费者关心的不仅仅是一盒糖果,而是产品的品质如何、口感如何、味道如何,价格是优惠等液' }
        , { userId: 1, id: 26, title: '伊利纯牛奶', introduce: '伊利纯牛奶是伊利旗下很受欢迎的一款奶制品，含有很丰富的蛋白质、钙元素以及其它微量元素，给儿童、青少年、中老年人以及孕妇补充身体所需要的能量，并促进身体健康' }
        , { userId: 1, id: 27, title: '旺仔牛奶', introduce: '旺仔牛奶相信大家都喝过，小时候常常能在电视上看到它的广告，各种广告台词也深入人心，一看到它的IP就总…真正的牛奶，而是一种复原乳，还被称为再制奶，它是用浓缩乳或者乳粉加入一定比例的水重新做成的一款乳液' }
        , { userId: 1, id: 28, title: '旺旺碎冰冰', introduce: '这款旺旺碎冰冰实在太棒了太好吃了,旺旺是大品牌质量有保障,品质信得过,孩子非常喜欢吃,各种口味都有,酸甜可口,让人爱不释口,回味无穷液' }
        , { userId: 1, id: 29, title: '喜之郎', introduce: '喜之郎品牌，创立于1992年，属于广东喜之郎集团有限公司，旗下产品包括喜之郎果冻、美好时光海苔、优乐美奶茶、开心时间饼干等。喜之郎系列产品被评为“中国名牌产品”液' }
        , { userId: 1, id: 30, title: '德芙', introduce: '德芙巧克力似乎早已成为人们传递情感、享受美好瞬间的首选佳品。面对太多的选择,消费者关心的不仅仅是一盒糖果,而是产品的品质如何、口感如何、味道如何,价格是优惠等液' }
        , { userId: 1, id: 31, title: '伊利纯牛奶', introduce: '伊利纯牛奶是伊利旗下很受欢迎的一款奶制品，含有很丰富的蛋白质、钙元素以及其它微量元素，给儿童、青少年、中老年人以及孕妇补充身体所需要的能量，并促进身体健康' }
        , { userId: 1, id: 32, title: '卫龙辣条', introduce: '一直以来,卫龙美味坚守“让世界人人爱上中国味”的使命,不懈努力实现“传统美食娱乐化、休闲化、便捷化、亲民化、数智化,乐活123年的生态平台”的美好愿景,以传统美味为载体' }
        , { userId: 1, id: 33, title: '卫龙辣条', introduce: '一直以来,卫龙美味坚守“让世界人人爱上中国味”的使命,不懈努力实现“传统美食娱乐化、休闲化、便捷化、亲民化、数智化,乐活123年的生态平台”的美好愿景,以传统美味为载体' }],
    message: "请求成功"
}


const obj2 = {
    code: 200,
    data: [
        {
            id: 1,
            nickName: "小明",
            role: [{ role: 1, roleName: '管理员' }
                , { role: 2, roleName: '普通用户' }],
            userName: "小明"
        },

        {
            id: 2,
            nickName: "红红",
            role: [{ role: 1, roleName: '管理员' }],
            userName: "红红"
        },
        {
            id: 3,
            nickName: "绿绿",
            role: [{ role: 2, roleName: '普通用户' }],
            userName: "绿绿",
        }
    ]
}

const obj3 = {
    code: 200,
    data: [
        {
            authority: [1, 2, 4, 5, 6, 7, 8, 9, 11, 13, 14, 15, 16],
            roleId: 1,
            roleName: "管理员"
        }, {
            authority: (10)[1, 3, 4, 6, 7, 8, 9, 11, 12, 13],
            roleId: 2,
            roleName: "普通用户"
        }

    ]
}

const obj4 = {
    code: 200,
    data: [
        {
            name: "订单列表",
            roleId: 1,
            roleList: [
                {
                    name: "订单详情",
                    roleId: 4,
                    roleList: [{ name: '审核', roleId: 5 }],
                    viewRole: ""
                },
                { name: '查看', roleId: 2 },
                { name: '删除', roleId: 3 }
            ],
            viewRole: ""
        },
        {
            name: "商品列表",
            roleId: 6,
            roleList: [
                {
                    name: "商品详情",
                    roleId: 9,
                    roleList: [{ name: '修改', roleId: 10 }],
                    viewRole: ""
                },
                { name: '查看', roleId: 7 },
                { name: '删除', roleId: 8 }
            ],
            viewRole: ""
        },
        {
            name: "用户列表",
            roleId: 11,
            roleList: [
                { name: '用户详情', roleId: 14, viewRole: '' },
                { name: '查看', roleId: 12 },
                { name: '修改', roleId: 13 }
            ],
            viewRole: ""
        },
        {
            name: "角色管理",
            roleId: 15,
            roleList: [
                { name: '用户详情', roleId: 17, viewRole: '' },
                { name: '查看', roleId: 18 },
                { name: '修改', roleId: 16 }
            ],
            viewRole: ""
        }
    ]
}